Extensions/ИнтеграцияGreenApi/DataProcessors/iga_ChatBot.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<DataProcessor>
		<Properties>
			<Name>iga_ChatBot</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>IdInstance</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ApiToken</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>webhookUrl</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтервалОтправкиСообщений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтмечатьВходящиеСообщенияПрочитанными</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучатьВходящиеСообщенияИФайлы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучатьВходящиеУведомления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучатьСтатусыОтправленныхСообщений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучатьУведомленииОСостоянииТелефона</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучатьУведомленияОСостоянииАккаунта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>apiUrl</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>mediaUrl</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыставлитьСтатусВСети</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательВебХука</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольВебХука</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортВебХука</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/InformationRegisters/iga_СтатусыПодтвержденияСтрокЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>iga_СтатусыПодтвержденияСтрокЗаявок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.iga_СтатусыПодтвержденияЗаявок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Обработано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заявка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Работа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/InformationRegisters/iga_ОповещенияПоВремени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>iga_ОповещенияПоВремени</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Выполнено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребуетсяПодтверждение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Чат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_Чаты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШаблонОповещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_ШаблоныСообщений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заявка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаОповещения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/Enums/iga_СтатусыПодтвержденияЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>iga_СтатусыПодтвержденияЗаявок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Подтверждено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяПеренос</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Просрочено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перенесено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеОтвечает</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтмененоАвтоматически</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/Enums/iga_ВидыПредопределенныхШаблонов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>iga_ВидыПредопределенныхШаблонов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НоваяЗаписьСПодробностями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НоваяЗаписьБезПодробностей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодтверждениеЗаписи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОповещениеОЗаписи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СообщениеОбОтменеБезОтвета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвтоматическоеСообщениеОбОтмене</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СообщениеОбОтмене</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/Catalogs/iga_Чаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>iga_Чаты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/DataProcessors/iga_ChatBot/Forms/ПереченьОтменыПереноса/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Чат = Параметры.Чат;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_Чаты.Ссылка КАК Чат,
	               |	iga_Чаты.Идентификатор КАК ИдЧата,
	               |	iga_СтатусыПодтвержденияСтрокЗаявок.Заявка КАК Заявка,
	               |	iga_СтатусыПодтвержденияСтрокЗаявок.Работа КАК Работа,
	               |	iga_СтатусыПодтвержденияСтрокЗаявок.Статус КАК Статус,
	               |	iga_СтатусыПодтвержденияСтрокЗаявок.ДатаЗаписи КАК ДатаЗаписи
	               |ИЗ
	               |	Справочник.iga_Чаты КАК iga_Чаты
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.iga_СтатусыПодтвержденияСтрокЗаявок КАК iga_СтатусыПодтвержденияСтрокЗаявок
	               |		ПО iga_Чаты.Клиент = iga_СтатусыПодтвержденияСтрокЗаявок.Заявка.Клиент
	               |ГДЕ
	               |	НЕ iga_СтатусыПодтвержденияСтрокЗаявок.Обработано
	               |	И НЕ iga_СтатусыПодтвержденияСтрокЗаявок.Статус = &СтатусПодтверждена
	               |	И НЕ iga_СтатусыПодтвержденияСтрокЗаявок.Статус = &СтатусПусто
	               |	И НЕ iga_СтатусыПодтвержденияСтрокЗаявок.Статус = &СтатусНеОтвечает
	               |	И iga_Чаты.Ссылка = &Чат";
	Запрос.УстановитьПараметр("СтатусПодтверждена", Перечисления.iga_СтатусыПодтвержденияЗаявок.Подтверждено);
	Запрос.УстановитьПараметр("СтатусПусто", Перечисления.iga_СтатусыПодтвержденияЗаявок.ПустаяСсылка());
	Запрос.УстановитьПараметр("СтатусНеОтвечает", Перечисления.iga_СтатусыПодтвержденияЗаявок.ПустаяСсылка());
	Запрос.УстановитьПараметр("Чат", Чат);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(СписокПозиций.Добавить(), Выборка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПозицийПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокПозицийПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаСервере
Функция ОтметитьОтработку()
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОтработанныеЗаявки = Новый Массив;
	
	Язык = iga_МетодыРаботыСБотом.ПолучитьЗначениеПараметраОбщения(Чат, "Язык");
	
	Для Каждого Позиция Из СписокПозиций Цикл
		Если Не Позиция.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		Запись = РегистрыСведений.iga_СтатусыПодтвержденияСтрокЗаявок.СоздатьМенеджерЗаписи();
		Запись.Заявка = Позиция.Заявка;
		Запись.Работа = Позиция.Работа;
		Запись.ДатаЗаписи = Позиция.ДатаЗаписи;
		Запись.Прочитать();
		Запись.Статус = Позиция.Статус;
		Если Запись.Выбран() Тогда 
			Запись.Обработано = Истина;
			Запись.Записать();
			ОтработанныеЗаявки.Добавить(Позиция.Заявка);
		КонецЕсли;
		
		Если Запись.Статус = Перечисления.iga_СтатусыПодтвержденияЗаявок.НеОтвечает Тогда
			
			Шаблон = Справочники.iga_ШаблоныСообщений.Предопределенный(
				Перечисления.iga_ВидыПредопределенныхШаблонов.СообщениеОбОтменеБезОтвета, Язык);
			Если Не ЗначениеЗаполнено(Шаблон) Тогда
				Продолжить;
			КонецЕсли;
			ЗаписьОбОтмене = РегистрыСведений.iga_ОповещенияПоВремени.СоздатьМенеджерЗаписи();
			ЗаписьОбОтмене.Чат = Чат;
			ЗаписьОбОтмене.Заявка = Позиция.Заявка;
			ЗаписьОбОтмене.ДатаЗаписи = Запись.ДатаЗаписи;
			ЗаписьОбОтмене.ШаблонОповещения = Шаблон;
			ЗаписьОбОтмене.ДатаОповещения = iga_ОбщегоНазначенияКлиентСервер.ДобавитьКДате(Запись.ДатаЗаписи, "ЧАС", -3);
			Если Час(ЗаписьОбОтмене.ДатаОповещения) > 20 Тогда
				ЗаписьОбОтмене.ДатаОповещения = iga_ОбщегоНазначенияКлиентСервер.ДобавитьКДате(НачалоДня(ЗаписьОбОтмене.ДатаОповещения), "ЧАС", 20);
			ИначеЕсли Час(ЗаписьОбОтмене.ДатаОповещения) < 6 Тогда
				ЗаписьОбОтмене.ДатаОповещения = iga_ОбщегоНазначенияКлиентСервер.ДобавитьКДате(НачалоДня(НачалоДня(ЗаписьОбОтмене.ДатаОповещения)-1), "ЧАС", 20);
			КонецЕсли;
			ЗаписьОбОтмене.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОтработанныеЗаявки", ОтработанныеЗаявки);
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_ОповещенияПоВремени.Заявка КАК Заявка,
	               |	iga_ОповещенияПоВремени.ДатаОповещения КАК ДатаОповещения,
	               |	iga_ОповещенияПоВремени.Выполнено КАК Выполнено,
	               |	iga_ОповещенияПоВремени.ТребуетсяПодтверждение КАК ТребуетсяПодтверждение,
	               |	iga_ОповещенияПоВремени.ДатаЗаписи КАК ДатаЗаписи,
	               |	iga_ОповещенияПоВремени.Чат КАК Чат
	               |ИЗ
	               |	РегистрСведений.iga_ОповещенияПоВремени КАК iga_ОповещенияПоВремени
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.iga_СтатусыПодтвержденияСтрокЗаявок КАК iga_СтатусыПодтвержденияСтрокЗаявок
	               |		ПО iga_ОповещенияПоВремени.Заявка = iga_СтатусыПодтвержденияСтрокЗаявок.Заявка
	               |			И iga_ОповещенияПоВремени.ДатаЗаписи = iga_СтатусыПодтвержденияСтрокЗаявок.ДатаЗаписи
	               |			И (iga_СтатусыПодтвержденияСтрокЗаявок.Статус В (&СтатусыПодтверждения))
	               |ГДЕ
	               |	iga_ОповещенияПоВремени.Заявка В(&ОтработанныеЗаявки)
	               |	И НЕ iga_СтатусыПодтвержденияСтрокЗаявок.Работа ЕСТЬ NULL
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	iga_ОповещенияПоВремени.ТребуетсяПодтверждение,
	               |	iga_ОповещенияПоВремени.Выполнено,
	               |	iga_ОповещенияПоВремени.Чат,
	               |	iga_ОповещенияПоВремени.ДатаОповещения,
	               |	iga_ОповещенияПоВремени.Заявка,
	               |	iga_ОповещенияПоВремени.ДатаЗаписи";
	СтатусыПодтверждения = Новый Массив;
	СтатусыПодтверждения.Добавить(Перечисления.iga_СтатусыПодтвержденияЗаявок.Отменено);
	СтатусыПодтверждения.Добавить(Перечисления.iga_СтатусыПодтвержденияЗаявок.Перенесено);
	Запрос.УстановитьПараметр("СтатусыПодтверждения", СтатусыПодтверждения);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ЗаписьОповещения = РегистрыСведений.iga_ОповещенияПоВремени.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(ЗаписьОповещения, Выборка);
		ЗаписьОповещения.Прочитать();
		Если ЗаписьОповещения.Выбран() Тогда
			ЗаписьОповещения.Удалить();
		КонецЕсли;
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Асинх Процедура Отработано(Команда)
	
	Ответ = Ждать ВопросАсинх("Установить отработку по выбранным позициям?", РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Да,, КодВозвратаДиалога.Нет);
	
	Если Не Ответ = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Успех = ОтметитьОтработку();
	Если Успех Тогда
		Закрыть(Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокПозицийСтатусПриИзменении(Элемент)
	
	Элементы.СписокПозиций.ТекущиеДанные.Пометка = Истина;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура СписокПозицийНоваяДатаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	
КонецПроцедуры
